export interface Room {
    id: number;
    type: string;
    price: number;
    size: string;
    img: string;
    stars: number;
    details: string;
  }
  
  export const roomData: Room[] = [
    { 
      id: 1, 
      type: 'ห้องพักรายวัน', 
      price: 500, 
      size: '24 sqm', 
      img: '/meme-meo-2.jpg', 
      stars: 5, 
      details: 'ห้องพักมาตรฐาน เหมาะสำหรับการพักอาศัยคนเดียว มีเฟอร์นิเจอร์พื้นฐาน เตียงนอน โต๊ะทำงาน และตู้เสื้อผ้า อินเทอร์เน็ตความเร็วสูง และเครื่องปรับอากาศ' 
    },
    { 
      id: 2, 
      type: 'ห้องพักรายเดือน', 
      price: 1500, 
      size: '32 sqm', 
      img: '/Screenshot 2024-06-28 141050.png', 
      stars: 5, 
      details: 'ห้องพักขนาดใหญ่ขึ้น มีพื้นที่ใช้สอยเพิ่ม มีมุมพักผ่อน ระเบียงส่วนตัว พร้อมเฟอร์นิเจอร์คุณภาพสูง เครื่องปรับอากาศอินเวอร์เตอร์ และอินเทอร์เน็ตความเร็วสูง' 
    },
    { 
      id: 3, 
      type: 'Suite Room', 
      price: 7000, 
      size: '42 sqm', 
      img: '/meme-meo-2.jpg', 
      stars: 5, 
      details: 'ห้องพักระดับพรีเมียม มีห้องนั่งเล่นแยกส่วน พื้นที่ใช้สอยมาก พร้อมเฟอร์นิเจอร์หรู เครื่องใช้ไฟฟ้าครบครัน ระเบียงขนาดใหญ่ วิวสวย เครื่องปรับอากาศระบบอัจฉริยะ และอินเทอร์เน็ตความเร็วสูงพิเศษ' 
    }
  ];